"Jibrish"	"/r/Conservative Official Political Discord"
"Lionhearted09"	"Holocaust Museum In Florida Sparks Outrage After Adding George Floyd Exhibit"
"optionhome"	"Do Trump-Supporters Live in an Alternate Universe? Actually a huge number of Americans have a false impression of reality because they are being told lies by their media. The people who constantly hear these lies do live in an \"alternate reality.\""
"Winterhold2000"	"Lin Wood tells Republican supporters NOT to back GOP candidates in the Georgia runoff election because they've 'failed' to help the President's fight to overturn the election"
"guanaco55"	"After Trans Activists Try To Ban The Book ‘Irreversible Damage,’ It Becomes A Bestseller -- Trans activists keep bullying businesses into removing content through fear tactics rather than by countering the message with their own better one."
"optionhome"	"Nearly 40 Shot Friday into Sunday Morning in Lightfoot's Chicago"
"Pessimist2020"	"Gavin Newsom Alerted To Illegal Activity By The Sound Of Children’s Laughter"
"domisking92"	"In Canada, you have to show ID and proof of address to vote in Federal elections"
"cavboy2flyboy"	"Trump campaign says Sidney Powell not a member of legal team"
"Qplus17"	"In Apparent Glitch, Voting Machines Hunt Down And Murder Trump Supporters"
"LunchroomRumble"	"Beijing-Controlled News Outlet Paid US Newspapers Millions To Publish Propaganda This Year"
"Drunken_Priest"	"‘It Will Be Epic’: Sidney Powell Releases Another Statement After Lawyers Say She’s Not On Team"
"skonats"	"Calls for Britain to give asylum to Pakistani Christian girl forced to marry Muslim man who abducted and gang-raped her"
"LimeSugar"	"‘You’re Such A D**k’: New Jersey Gov Confronted Eating Maskless Outside With His Family"
"Nucka574"	"Sidney Powell Confirms Non-Affiliation With Trump Legal Team, Vows to Continue Fraud Fight"
"Juliemylove"	"Protesters take to the streets in California to bash Newsom's curfew orders"
"Beliavsky"	"“Burn It Down” -- Activists in Seattle want to abolish police, prisons, and courts."
"guanaco55"	"Sidney Powell Responds to Trump Campaign's Statement Saying She's Not Part of Legal Team -- Powell said her fight will go on anyway and closed her statement with the hashtag, \"#KrakenOnSteroids\""
"guanaco55"	"Why The Left Can Be So Ridiculously Self-Righteous Without Realizing It -- What we saw in the lead up to the elections, and what we’ll witness for years to come, is utter contempt for Trump voters and conservatives in general."
"unspecialnoob"	"5 More Ways Joe Biden Magically Outperformed Election Norms"
"Winterhold2000"	"Police Union Tells Embattled New York Subway Riders 'You're on Your Own' amid the recent rash of shoving incidents by unhinged assailants"
"tenshon"	"Two-thirds of GOP voters support Trump running for president in 2024: survey"
"Snipuh21"	"Democrat House Losses Stemmed From Trump Increasing Voter Turnout: Rep. Richmond"
"ThePoliticalHat"	"Harvard creating new ‘antiracism’ librarian job. It pays up to $240,300 per year."
"guanaco55"	"Lou Dobbs Warns the GOP: Republican Party ‘Will Be Gone and Done’ If They Don’t Stand With President Trump"
"jade_crayon"	"China now blaming Italy for starting Wuhan coronavirus pandemic"
"Shlomo_Maistre"	"Late Justice Scalia's son blasts Harris for insinuating Catholic charity a hate group"
"Winterhold2000"	"Juan Williams: Obama's dire warnings about right-wing media. The power of right-wing media to distort reality “is the single biggest threat to our democracy,” Obama added. He found that GOP politicians concluded it was “politically advantageous to demonize me and the Democratic Party.”"
"Shlomo_Maistre"	"‘You Can’t Enforce’ Thanksgiving Lockdowns, New Mexico Governor Says"
"iResistBS"	"Judge Denies Injunction for “Black Only Relief Fund”"
"200319594"	"HISTORIC: Netanyahu Meets Saudi Prince in Saudi Arabia, Reports Say"
"Hps96"	"Viral video shows New York business owners take defiant stand when health inspector barges inside: 'Go get a warrant'"
"guanaco55"	"A Neighbor You Like Probably Voted For Trump"
"nobody65"	"Trump obsession: Democrats tweet about him 12,569 times to 486 about Biden"
"optionhome"	"WHO Director Dr. Tedros Moves the COVID-19 Goalposts Right Off the Playing Field. He wants you to know that vaccines won’t really change anything in response to COVID-19. His statement defies the management of any virus and there is no science to support it."
"optionhome"	"Union Bosses Sink Bernie Sanders as Labor Secretary"
"HighRoller390"	"\"Georgia Is the First State I’m Going to Blow Up and Mr. Kemp and the Secretary of State Need to Go With It!” — Sidney Powell"
"canfbar"	"Israel’s Netanyahu, Saudi Crown Prince Hold First Known Meeting"
"freq-ee"	"Trump’s legal team’s statement on Sydney Powell was made to focus on the upcoming Supreme Court case. There are two separate legal pathways. One on equal protection and PA voting rules (most important right now). The second is Dominion software which will take longer."
"huckingfoes"	"Walmart Thanks Government For Completely Obliterating Their Small Business Competition"
"livinginbizzaroworld"	"Putin Says He’s Not Ready to Recognize Biden as U.S. President"
"guanaco55"	"'Call of Duty: Black Ops Cold War' Affirms a Pro-American Worldview -- A rich gaming environment replete with Reagan administration cameos is just what the doctor ordered."
"guanaco55"	"America Needs A Special Counsel To Investigate Election Integrity, Stat -- With credible allegations of fraud compounding by the day, the American people deserve a special counsel investigation to set the record straight."
"reggie23e"	"Black Lives Matter Wisconsin leader - a convicted felon - arrested on suspicion of sexual assault"
"adp_17"	"GOP Likely to Gain Third US House Seat in California"
"guanaco55"	"HBO talkshow host Bill Maher slams Democrats for hypocrisy on COVID-19 protocol -- “They keep getting caught doing what we’re not allowed to do.”"
"triggernaut"	"Trump Pulls Out Of Military Transparency Treaty With Russia, Europe"
"Winterhold2000"	"George Takei: ‘I Want to Live in a Country Where Kaepernick is Seen as a Hero and Kyle Rittenhouse Is Seen as a Terrorist’"
"guanaco55"	"Left-Wing Activist And Actress Alyssa Milano Warned Against Electronic Voting Machines in 2018: ‘We Need Paper Ballots’"
"200319594"	"Viral Video: NJ Gov. Phil Murphy Confronted At Restaurant For Not Wearing Mask"
"Winterhold2000"	"New York Democratic Leaders Caught Maskless At Private Party Despite COVID Restrictions"
"ChunkyArsenio"	"WSJ Editorial Board: Stockton, CA elects Republican Mayor vowing safer streets"
"Shlomo_Maistre"	"Civil Disobedience: WATCH Angry business owners RESIST Cuomo's enforcement visit by Health Dept, Sheriff ⋆ The Savage Nation"
"JonnyBlizzard"	"Portman: No proof of mass fraud that would change election result"
"guanaco55"	"How Trump Responded When Liz Cheney Called on Him to Concede: \"Sorry Liz, can’t accept the results of an election with hundreds of thousands of fraudulent votes cast, enough to easily flip the Election. You’re just unhappy that I’m bringing the troops back home where they belong!\""
"XIIXOO"	"These 21 GOP Senators Show ‘Extreme Contempt’ For Trump In Private, According To Carl Bernstein"
"Knowledge-Future"	"Michael Flynn: Sidney Powell temporarily suspended from Twitter"
"XIIXOO"	"Dominion Voting Systems says it is 'physically impossible' for their machines to switch votes for candidates"
"theradiostarz"	"Trump Campaign Formally Requests a Recount in Georgia"
"geocentrist"	"UK Physician - \"Frankly, if it had not been for mainstream media and the government, I would not have even noticed there were a pandemic. I experienced no excessive dying, and no excessive becoming seriously ill.\""
"optionhome"	"In Oregon Crack cocaine was legalized in a November 3rd referendum along with all other illicit drugs while plastic straws were prohibited. The Oregon Health Authority however wants people to stay safe and remember to pull your mask back into place between puffs on your crack pipe."
"Dale_Gunther"	"Annoyed ABC Scolds Americans 'Not Listening,' Visiting Family on Thanksgiving"
"Shlomo_Maistre"	"Trump campaign demands recount, signature matching in Georgia"
"Winterhold2000"	"AOC: Does anyone believe Rittenhouse would be released if he were Muslim &amp; did the same thing in a diff context? For people who say “systemic racism doesn’t exist,” this is what it looks like: protection of white supremacy baked deep into our carceral systems."
"guanaco55"	"Trump: More Votes Than Voters in Key Swing States"
"Winterhold2000"	"Open Letter Calls on Harvard to Create 'System of Accountability' for Inviting Trump Admin Alums to Campus"
"AnotherNewRddt"	"Federal judge dismisses Trump campaign’s Pennsylvania case"
"guanaco55"	"Court Rules Tennessee Can Outlaw Down Syndrome, Race, and Gender Abortions"
"mikireal19"	"After Pelosi Claims She Wants To Provide Relief – Records Show 40 Times The House Democrats Blocked Relief Aid"
"LawVol99"	"Latinos in South Texas Voted Against Illegal Immigration and CBP Demonization"
"Dale_Gunther"	"5 More Ways Joe Biden Magically Outperformed Election Norms"
"livinginbizzaroworld"	"Statement from Sidney Powell to \"WE THE PEOPLE\""
"Shlomo_Maistre"	"Oregon governor backs idea of alerting authorities on neighbors who violate COVID-19 restrictions"
"tenshon"	"Pope Francis in new book criticizes anti-lockdown protesters"
"Farmwife64"	"California School District Bans Use of Classic Books in Classroom Over Racism Complaints"
"MuniPal"	"Sidney Powell Releases Statement"
"guanaco55"	"Bombshell: Biden takes min 98% of a 23,487 vote batch at 12:18AM in GA"
"HighRoller390"	"Watergate journalist Carl Bernstein outs 21 Republican senators who 'privately' expressed 'extreme contempt' for Trump."
"guanaco55"	"Sidney Powell Is an American Legal Giant -- She is fighting for our Republic right now because – make no mistake – honest American elections, and the continuing viability of our democracy, is on the line."
"UrdukMemphis"	"Gov. Kemp calls for signature audit of Georgia vote"
"Shlomo_Maistre"	"The U.S. has withdrawn from the Treaty on Open Skies"
"ThePoliticalHat"	"Media Unveils Bold New Plan to Win Latino Support by Calling Them Racist"
"canfbar"	"Do as I say, not as I do: California's top Democrats display their hypocrisy over COVID-19"
"HighRoller390"	"If the 2020 Election Was Held in a Foreign Country, the State Department and Western Media Would Declare it \"Fraudulent\" -"
"RandomSleepTimes"	"Eyes rolling so hard that I can see the back of my skull. I guess pollution is racist now too!"
"Shlomo_Maistre"	"'Hundreds' Of NYC Coronavirus Victims' Bodies Still Being Stored In Freezer Trucks"
"newaccttrial"	"Mass Protest at CNN: Your Fake News Gig Is Up"
"optionhome"	"Newsom pressured to pick ‘woman of color’ to fill Senate seat. Former San Francisco Mayor Willie Brown is pushing Maxine Waters among others."
"Beliavsky"	"Banks Give Black-Owned Businesses Advantage on Supply-Chain Finance Terms. Programs spring from multibillion-dollar commitments banks made to expand lending and investment after Black Lives Matter protests this year"
"Dale_Gunther"	"DC bill wants to allow kids to take vaccines without parents"
"Ar509"	"CA-25: Garcia(R) declares victory, Smith declines to concede"
"HighRoller390"	"Miami Herald warning on Smartmatic 3/29/2006: “Software engineers with links to the Leftist, anti-American regime of Hugo Chavez are in charge of programming electronic voting machines that will soon power U.S. elections”"
"livinginbizzaroworld"	"LORD SUMPTION: Wrong for government to tell us what to do at Christmas"
"guanaco55"	"Iowa's GOP Miller-Meeks Leads By 50 Votes In Nation's Closest House Race"
"InkyScrolls"	"Joseph Stalin To Receive International Emmy For His Outstanding Hunger Relief Efforts"
"bobbyw24"	"Kevin McCarthy: Voters Have Rejected Pelosi's 'Socialist' Agenda"
"Shlomo_Maistre"	"A dozen compelling allegations of voting irregularities in 2020 election"
"Farmwife64"	"Lib Priest's Bashing of ACB's Latest Decision Accidentally Admits We Were Right All Along"
"oz4ut"	"BREAKING: FDA Grants Emergency Use Authorization To Antibody Cocktail Used By Trump"
"canfbar"	"China Proposes Global 'Track and Trace' System for Travel Reset"
"alc59"	"Brooklyn political elite ignore COVID-19 rules at birthday party for Carlo Scissura"
"tenshon"	"Majority say they want GOP in control of Senate: poll"
"HighRoller390"	"Let's talk about the \"where is the evidence\" meme"
"Winterhold2000"	"How to explain Latino support for Trump? ABC News reports misleading memes went viral in Latino communities"
"Foubar_ghost"	"High family income, not SAT scores, is your real ticket to Harvard, Yale, and Princeton"
"whitten93"	"Professor causes uproar asking Biden voters to unfriend him"
"adp_17"	"Kevin McCarthy: Voters Have Rejected Pelosi's 'Socialist' Agenda"
"nobody65"	"Reap What You Sow: Media Who Coddled Biden for Months Now Complain About Mistreatment"
"ChunkyArsenio"	"Julie Burchill: President Trump has loved and been great for Israel"
"Coogrrr94"	"Mike Flynn Jr. adds twist to Trump team’s statement on Sidney Powell: ‘Give this the 24hr rule …’"
"optionhome"	"Illinois Governor Pritzker Snubs Lori Lightfoot's \"Do Not Travel\" Advisory. He May Leave Chicago For Thanksgiving"
"LawVol99"	"AOC slams Kyle Rittenhouse’s release on $2M bond as ‘law and disorder’"
"ThePoliticalHat"	"The Latest Memorial to George Floyd Is in a Holocaust Museum"
"guanaco55"	"The Fight Ahead: Our Media Is Trash. Their Words Are Worth Nothing. The fight ahead is real."
"0ldManFrank"	"Omar Urges Biden To Reverse Trump's Agreements In The Middle East And Claims They Were \"Not Peace Deals\""
"guanaco55"	"Devout Catholic Joe Biden, our most pro-abortion president"
"Beliavsky"	"Religion, Liberty, and Religious Liberty. Macron is pushing France to confront the implications of Islamism for liberal democracy."
"TheYoungLung"	"Trump Lawyer Sidney Powell Promises 'Biblical' Lawsuit in Coming Days"
"Sartevscamus"	"Political Enemy Lists: Copies of the Lists Trump Accountability Project Put Online Election Day"
"walter_r_kovacs"	"This would literally kill me"
"Briguy28"	"Guatemalan protesters storm Congress, light building on fire as clashes with government forces escalate"
"mobi1408"	"France: Macron and his Islamic Rivals | Jayzoq"
"guanaco55"	"An Urgent Appeal to WHO: Let Taiwan Speak -- If WHO is serious about the pandemic, it will listen to the nation that successfully confronted it — and stop kowtowing to Beijing."
"guanaco55"	"Alito Points to Warning Signs That Threaten a Free and Civil Society"
"oz4ut"	"BLM Founders Demand Joe Biden Support A 'Roadmap' To Abolition Of Police, Prisons"
"Beliavsky"	"Subway shoving, flamethrowers, shootings in NYC blamed on 'perfect storm' of police reform, pandemic. Shootings have almost doubled from last year following a long era of low crime rates"
"Shlomo_Maistre"	"Gen. Flynn: Sidney Powell 'Staying the Course,' Will Prove Alleged Election Fraud"
"geocentrist"	"Dr. Michael Yeadon, former VP of Pfizer, explains in video why the pandemic is essentially over"
"guanaco55"	"WaPo Columnist Has an Epic Meltdown Over Republicans Standing By Claims of Voter Fraud"
"guanaco55"	"To Restore Election Integrity, End Mail-In Vote Fraud"
"whitten93"	"Trump Derangement Syndrome in Democrats won't go away with Trump"
"Pessimist2020"	"Fauci Renews Pandemic For Highly Anticipated Season 2"
"Winterhold2000"	"Merkel, Germany's 'eternal' chancellor, marks 15 years in power"
"alc59"	"Remember when: Activists urge Clinton camp to challenge election results in three states"
"InkyScrolls"	"Philly Bans All Indoor Gatherings Unless You're Still Counting Biden Votes"
"guanaco55"	"Trump campaign adviser Steve Cortes: Sudden Stop In Mail-In Vote Count 'Suspicious' -- Particularly since it was followed by a \"deluge\" of votes for Joe Biden in key battleground states."
"guanaco55"	"Trump Team Files for Fresh Recount in Georgia’s Presidential Race"
"Foubar_ghost"	"CNN Condemns Trump Rallies As 'Physically Peaceful But Morally Violent'"
"optionhome"	"Florida Holocaust museum opens exhibition about George Floyd"
"Winterhold2000"	"5 NBA Players Meet With Pope Francis To Talk Social Justice"
"nobody65"	"Leftists Hate on Free Speech Platforms GAB and Parler: Where is this Going?"
"DeanMalHanNJackIsms"	"Man spits on hikers for not wearing a mask"
"westcoastwalruses"	"Inside the Fight to Abolish Police in Philadelphia"
"newaccttrial"	"Dominion responds to Trump team claims"
"guanaco55"	"McEnany: We Have To Take Election To The Supreme Court To Expose \"Systemic Voter Fraud\""
"guanaco55"	"HBO’s John Oliver Called It ‘Completely Insane’ to Use Electronic Voting Machines in Nov. 2019"
"CornHuskManager"	"Sisolak limits gathering sizes for restaurants to 25% and require reservations to bars that serve food."
"guanaco55"	"Marsha Blackburn: Big Tech Censorship 'Choosing Winners And Losers'"
"guanaco55"	"Polish Prime Minister: EU ‘Oligarchy’ Wielding ‘Propaganda Bludgeon’ Like Former Communist Regime"
"Briguy28"	"Nicolas Sarkozy, former President of France goes to trial on charges of corruption"
"Practical-Share-44"	"House GOP wins suggests party growth, possible majority in 2022 | One America News Network"
"AEDELGOD"	"Here Is The Evidence"
"Snipuh21"	"China Issues Instructions for ‘Incoming Biden Administration’"
"Shlomo_Maistre"	"George Soros-linked election software company lies about ties with Dominion | One America News Network"
"PardonOurPolitics"	"Why Fewer People Should Go to College"
"Farmwife64"	"Sacramento Sheriff on Not Enforcing COVID Curfew: Making Cops 'Instruments' of 'Oppression' Damages Community Relations"
"ChunkyArsenio"	"Madeline Grant: UK hasn't had a pro-liberty PM since Thatcher"
"Winterhold2000"	"GOP senator says Trump to Biden transition should begin 'tomorrow morning'"
"guanaco55"	"Ilhan Omar Urges Biden to ‘Reverse’ President Trump’s Middle East Agreements -- Thinks that peace between Israel and Arab nations is a bad thing."
"guanaco55"	"All Republicans should support President Trump's legal fights -- Any who believe that buddying up to the Biden team is a symbol of unity, and better for America, have already abandoned Trump, conservatism, and America."
"TheKinginMissouri"	"Christianity and the Future of American Conservatism | Mark Movsesian"
"Foubar_ghost"	"Poll shows Republican favorability of Fox News has dropped after Election Day"
"theradiostarz"	"Latest: Why a Federal Judge Tossed Out One of the Trump Campaign's PA Lawsuits"
"mrquestions666"	"An statement from Senator Toomey regarding the Pennyslvania Federal Court decision regarding the Trump campaign lawsuit."
"chitown12076"	"Pope Francis hosts NBA players to talk social justice."
"Ken-Crow"	"Will Republicans Learn From The 2020 Election?"
"PurpleAngel23"	"U.S. retailer Guitar Center files for bankruptcy"
"HighRoller390"	"\"Kracken\" is a ClA Hacking Program"
"alc59"	"NY company makes window stickers of Cuomo watching over your Thanksgiving"
"Throw1272"	"Judge Dismisses Trump Campaign Suit to Invalidate PA Election Certification With Prejudice"
"guanaco55"	"Chris Christie Waddles to Lead the SurrenderCon Pack"
"tenshon"	"Scranton dedicates 'Joe Biden Way' to honor president-elect"
"wra1th3_Ai"	"NY Business Owners Kick Out Health Dept, Sheriffs: “Civil Disobedience Starts Now”"
"ChunkyArsenio"	"US Exits Open Skies Treaty, Moves to Discard Observation Planes"
"radunas"	"Chinese Warn Against Communism at Trump Rally, Tell Americans to Speak Out"
"Nuncle_Milty"	"Waffle House’s Stand Against Lockdowns Is Exactly What America Needs—Almost | \"None of the people who make the decisions to shut down businesses and impact people's livelihoods ever have their own livelihood impacted,\" the Waffle House CEO recently told Business Insider."
"ChunkyArsenio"	"US seeks right to bomb Kenya as Islamic terrorists spread"
"ChunkyArsenio"	"Dominic Lawson: The UK practices eugenics (on Down's Syndrome)"
"radunas"	"Ohio Shifts Red: Analysts Believe Buckeye State No Longer Swing State"
"0ldManFrank"	"Hispanic Voters In Florida Who Fled Dictatorships Think The Election Was Stolen From Trump"
"guanaco55"	"Michigan Canvass Board Member: 'Need Evidence' to Delay Certification"
"Clackamas1"	"There’s a way to fix the $4.6 trillion U.S. public pensions mess — Canada shows us how"
"samspenc"	"Illinois Voter: \"You Don't 'Install' a President, You Elect a President\""
"guitarzer0"	"Britons who test negative for Covid set to receive a 'freedom pass'"
"Racheakt"	"Watergate reporter Carl Bernstein lists 21 GOP senators"
"interestingfactoid"	"Pennsylvania election: Trump appeals dismissal of bid to block vote certification"
"PettyWitch"	"The Death Star Strategy: Is Trump Contemplating The Ultimate Constitutional Trick Shot?"
"GenZConservative1776"	"All Americans Should Celebrate Thanksgiving Despite Covid"
"canfbar"	"Do Trump Supporters Live in an Alternate Universe?"
"Foubar_ghost"	"Joseph Stalin To Receive International Emmy For His Outstanding Hunger Relief Efforts"
"canfbar"	"REVEALED: Dominion/Smartmatic 'Noncompete' Agreement Emerges Despite Claims of Being 'Fierce Competitors'"
"AddictedReddit"	"Obama won first election by invalidating signatures, filing complaints similar to Trump's"
"Wing_attack_Plan_R"	"2008 FlashBack: CNN Says Obama Won His Senate Primary by Tossing Ballots Without Matching Signatures"
"optimistic_marzipan"	"Huntington Beach protests California’s coronavirus curfew"
"adp_17"	"DHS officials warn illegal border crossings are surging in anticipation of Biden presidency"
"nobody65"	"OUT: I Am Strong, I Am Invincible. IN: Boys Have Cooties! - Duke sorority council bans events with male groups."
"mikireal19"	"Texan Matthew McConaughey Considering Political Run – He’s Looking To Jump Straight To The Top As Governor"
"ChunkyArsenio"	"Ross Clark: (UK) This is the next phase of a ruinous cycle of illogical restrictions"
"nobody65"	"Making sense of the news about Sidney Powell"
"ChunkyArsenio"	"Shelby Steele: The Inauthenticity Behind Black Lives Matter"
"0ttervonBismarck"	"Sidney Powell: 'Biblical' Lawsuit Coming, Accuses Ga. Gov. Kemp of Deal With Dominion"
"tenshon"	"Kelly Loeffler quarantining after positive, inconclusive coronavirus tests: campaign"
"knownbuyer3"	"Actor Scott Baio threatens to move to Utah to unseat Sen. Mitt Romney after his anti-Trump tweet"
"nobody65"	"Democrats plan to bring back earmarks. Ready the pork barrel!"
"Jorgzs"	"Pennsylvania Judge Dismisses Trump Campaign's Challenge to Pennsylvania Election Law"
"nobody65"	"GOP Can't Let Trump-Hating Squishes Take Over the Party Now"
"nobody65"	"Help! Pollsters Have Fallen and They Can't Get Up!"
"TheBaronOfTheNorth"	"Ben Carson: Trump Saved My Life After I Got COVID"
"guanaco55"	"Republicans fuming after Dominion Voting Systems backs out night before scheduled PA oversight hearing"
"optionhome"	"Higher education cartoon of the week \"They pay You?\""
"emaxwell13131313"	"Gov. Andrew Cuomo to receive Emmy award for his 'leadership' during the pandemic, Twitter goes nuts"
"ThePoliticalHat"	"Eleventh Circuit Enjoins Local Ordinances Barring \"Conversion Therapy\""
"guanaco55"	"Federal Election Commission Chair: Trump Campaign Has Legitimate Claims of Election Fraud"
"nobody65"	"Texas Passes Law Banning Californians From Voting After They Move There"
"radunas"	"Chinese American Says the Left, Big Tech Reminds Him of Communist China"
"nobody65"	"Don’t ‘Californicate’ The Rest Of America"
"nobody65"	"Finally America is realizing that Andrew Cuomo is a putz"
"Jezza_18"	"Trump Orders Hasty Afghanistan, Iraq Drawdowns to Beat Biden Inauguration"
"BaxterBlog"	"What the Media Is Hiding About the DHS’ Election Security Statement"
"MuniPal"	"Trump campaign attorney responds to Pennsylvania ruling &amp; they’re grateful"
"TheGloriousAmerican"	"Op-Ed: 2020 Election Results Show No Irregularities, By Ruth Bader Ginsburg"
"guanaco55"	"Trump Warns 'Massive Fraud' to Be Uncovered in Michigan Vote"
"livinginbizzaroworld"	"Report: Maryland Gov. Larry Hogan, Anti-Trump Hero, Paid for Flawed Coronavirus Tests from South Korea"
"HighRoller390"	"Georgia counties saw a mail-in ballot rejection rate as high as double digits, but magically all those problems disappeared in November? See the USA county map enclosed w/in the article for pre-November mail-in ballot rejection rates."
"invalid_data"	"NY Business Owners Stand Up To Unconstitutional \"Lockdown\" Orders"
"guanaco55"	"CA-25 Republican Rep. Mike Garcia Claims Victory; Democrat Christy Smith Cries Foul"
"TheKinginMissouri"	"Who’s Afraid of the Common Good?"
"outsidelight"	"Just a reminder: Obama won his very first election by charging his opponents with election fraud. Oh, you didn't know?"
"guanaco55"	"5 Reasons Making Taxpayers Pay Off Student Loans Is A Rotten Idea"
"ThePoliticalHat"	"Why not ‘My Fuhrer’? Appeals court grills public college on forcing professor to call male student ‘miss’"
"adp_17"	"Donald Trump Improved Standing With Latinos In 78 Of America’s 100 Majority-Hispanic Counties"
"alc59"	"G20 Leaders Move To Distribute Covid Vaccines Fairly"
"Son_of_the_Roman"	"Dutch doctors allowed to sedate euthanasia patients before their death"
"knownbuyer3"	"Philly Bans All Indoor Gatherings Unless You're Still Counting Biden Votes"
"PressureMaxwell"	"What Makes Internet Trolls Tick?"
"mikireal19"	"After 2,600 Uncounted Votes Turn Up In Georgia – The Chief Elections Clerk Finds A Pink Slip Waiting For Him"
"Shlomo_Maistre"	"Effort to recall Calif. Gov. Gavin Newsom granted 120 day extension to March 17 | One America News Network"
"VernalPedestrian"	"Million MAGA March: Unravelling a Violent Viral Video"
"Foubar_ghost"	"If We Want People To Accept A COVID-19 Vaccine, We Should Stop Lying To Them About The Disease"
"canfbar"	"U.K. to use AI tool to process 'high volume' of expected adverse reactions from COVID vaccine"
"RedofPaw"	"Trump camp's lawsuit struck down in Pennsylvania"
"ChunkyArsenio"	"Author Abigail Shrier faces threats after warning teen trans epidemic"
"guanaco55"	"Sacramento Sheriff on Not Enforcing COVID Curfew: Making Cops 'Instruments' of 'Oppression' Damages Community Relations"
"AtmanRising"	"Pa. Senator Pat Toomey Says President Trump Has 'Exhausted All Plausible Legal Options'"
"knownbuyer3"	"Judge Dismisses Trump Campaign’s Pennsylvania Lawsuit, Slams ‘Strained’ Reasoning; This only helps these cases reach higher levels of court because signed affidavits are admissible in court"
"whitten93"	"Biden's Surge In Polls Motivated By Fear"
"Ravens1112003"	"Are Covid Patients Gasping ‘It Isn’t Real’ As They Die?"
"Shlomo_Maistre"	"Recall California Governor Gavin Newsom (2020)"
"BaxterBlog"	"FLASHBACK: Experts Urge Clinton Campaign to Challenge Election Results in 3 Swing States (2016 claims of vote manipulation and hacking)"
"godsgonedogonnit"	"Summary: The biggest threat to our democracy, freedom, and prosperity is a sycophant media that campaigns for one party and seeks to destroy the other. We are not a systemically racist country and it is absolutely not a threat to our democracy for anyone to challenge the results in an election."
"guanaco55"	"Exiled Tibetan leader Lobsang Sangay visits White House, irking China"
"ChunkyArsenio"	"Ilana Mercer: Simplest Source of Voter Fraud Is Baked Into the System (Noncitizen voters)"
"tenshon"	"Trump campaign files for new recount in Georgia"
"whitten93"	"Study: Biden won thousands of illegal votes by noncitizens"
"guanaco55"	"Hungarian Prime Minister: 'Soros One of the Most Corrupt People in World'"
"williesmom1"	"China Hero Guangcheng Chen Decries Brutal Forced Abortions, Infanticide"
"BranofRaisin"	"Top House conservative plots post-Trump GOP"
"livinginbizzaroworld"	"Trump Announces Groundbreaking Rules to Lower Prescription Drug Prices"
"guanaco55"	"Sidney Powell: Whistleblowers 'May Need Witness Protection' After Their Allegations Are Brought to Light"
"Sartevscamus"	"The Dems and Liberal Media Have Raised Issues with Dominion, Smartmatic, and ES&amp;S for 20 Years. The Left and media has Known About Chavez's Ties to Smartmatic since 2006. Here's the Stories That They Can't Unwrite"
"XIIXOO"	"George Soros-Linked Election Software Company Lies About Ties With Dominion"
"JonnyBlizzard"	"Release: Toomey Statement on PA Federal Court Decision, Congratulates President-elect Biden | U.S. Senator Pat Toomey of Pennsylvania"
"guanaco55"	"Biden to ‘Racist’ Trump Voters: ‘Let’s Heal.’ That’s Easy for Him to Say."
"guanaco55"	"The Greatest Electoral Heist in American History -- The pieces are finally coming together, and they reveal a masterpiece of electoral larceny involving Big Tech oligarchs, activists, and government officials who prioritize partisanship over patriotism."
"LawVol99"	"Feds seek death penalty against gang leader accused of 7 murders"
"undue-influence"	"A Circuit Breaker on Election Night? (...nearly 30 percent of Democrat voters think the election was stolen from Trump)"
"radunas"	"Merkel's Germany Tells Trump Not to Bring Troops Home from Afghanistan"
"LawVol99"	"Gov. Brown encourages Oregonians to call police on neighbors who violate COVID-19 freeze"
"-mylankovic-"	"UN Hijacks #InternationalMensDay With Feminist “Wokeness”"
"guanaco55"	"Regeneron Gets Emergency Clearance for COVID-19 Therapy"
"MuniPal"	"Dr. Ben Carson: Trump Saved My Life After I Got COVID"
"ChunkyArsenio"	"Nick Timonthy: UK will be living with the devastating costs of the Covid governance for decades"
"whitten93"	"NY Mag Scientifically Proves Biden Supporters Are Racist"
"canfbar"	"Unemployment benefits are the worst kind of pandemic relief"
"guanaco55"	"CA-21 Republican David Valadao defeats Democrat Incumbent TJ Cox -- Reclaims another District stolen by ballot harvesting in 2018"
"tomoon"	"Detroit voters sue President Trump over his attempt to block certification of election results"
"The-Techie"	"AstraZeneca; Covid Vaccine 70% Effective"
"guanaco55"	"Why Gratitude Is Key To Worshiping Our Creator -- While praise, joy, contrition, and love are all important affections for worship, gratitude is the most important worship affection."
"bobbyw24"	"If the double-dip recession hits next year, Biden will remind us over and over that it’s Donald Trump’s fault. He’ll be wrong."
"radunas"	"New York City Cop Pummeled By Mob, Police Say"
"Foubar_ghost"	"Michigan AG Suggests Criminally Charging Republican Legislators for Meeting With Trump"
"guanaco55"	"Pence Visits Georgia, Vows to ‘Keep Fighting Until Every Illegal Vote Is Thrown Out’"
"HighRoller390"	"Wikileaks Dump - “KRAKEN” is a CIA Hacking Program"
"canfbar"	"Here Comes the Biden Blame Game - If the double-dip recession hits next year, Biden will remind us over and over that it’s Donald Trump’s fault. He’ll be wrong."
"guanaco55"	"If You Liked the 'New World Order,' You’ll Love 'The Great Reset' -- Your betters think you need to be \"reset\" and Covid-19 has presented the \"opportunity.\""
"TheBaronOfTheNorth"	"FDA Grants Emergency Use Authorization To Antibody Cocktail Used By Trump"
"Juliemylove"	"Drug overdose killed him, not my knee on his neck – Officer in George Floyd’s death"
"tenshon"	"Tibetan political leader makes visit to White House for first time in six decades"
"guanaco55"	"Xi Jinping’s Two Year Plan"
"samspenc"	"Green Card Holder in Nevada Received Mail-In Ballot: \"The Japanese man who is a green card holder said that although he is not a U.S. citizen, he received a mail-in ballot. He was puzzled as to why he was registered as a voter by local authorities.\""
"romark1965"	"Berkeley professor sparks outrage by claiming Trump supporters who have an 'indifference' to COVID are like Germans who 'ignored and profited from the Holocaust'"
"Winterhold2000"	"Mark Levin: Letting Trump's legal efforts play out far better than 'what the Democrats are doing to our institutions'"
"undue-influence"	"Howie Carr: Pam Kelley, another Kennedy casualty, passes away"
"TheYoungLung"	"Trump campaign statement on Pennsylvania ruling"
"JackLord50"	"Dominion shuttering offices, shredding documents in dash to forestall post-election investigations"
"therightnews"	"Sens. Warren, Klobuchar Sent Letter Warning About Dominion, Other Election Tech in 2019"
"geocentrist"	"Michigan Legislators Face Calls For Possible Criminal Charges After Meeting With President Trump On Certification"
"guanaco55"	"Jordan Sekulow: Pending Georgia Lawsuit 'Shocking' -- To those saying \"put up or shut up, it's coming this week.\""
"IBiteYou"	"Gut check."
"guanaco55"	"Trump Lawyers: Pennsylvania Lawsuit Dismissal Moves Us Closer to Supreme Court"
"cjdurrek"	"FDA Grants Emergency Use Authorization To Antibody Cocktail Used By Trump"
"guanaco55"	"Federal Court Strikes Down Florida LGBTQ Counseling Ban -- Struck down laws that prohibit mental health professionals from counseling children and teens who are troubled by unwanted same-sex attractions or gender dysphoria."
"KillaB33z"	"In new twist, Georgia governor urges audit of ballot envelop signatures to look for fraud"
"blaspheminCapn"	"Covid-19: Sweden's herd immunity strategy has failed, hospitals inundated"
"tenshon"	"Ben Carson says he's 'out of the woods' after being 'extremely sick' with COVID-19"
"ThaJerzeyDevil"	"It's getting bad out there better cancel 4th of July."
"optionhome"	"Gov. Cuomo wins Emmy for Best Portrayal of A Mass Murderer. “People around the world tuned in to find out what was going on and who Cuomo was going to kill next. It was really quite riveting”"
"IJustWantToBePure"	"Sheriffs not enforcing Newsom's coronavirus curfew, won't 'make criminals' of law-abiding citizens"
"tenshon"	"McEnany: Trump's path to victory is Supreme Court, exposing 'systemic' voter fraud"
"ChunkyArsenio"	"Lee Smith: Behind the Scenes, Obama Never Left"
"adp_17"	"‘I Had To Protect Myself’: Rittenhouse Speaks Out Before Jail Release; New Details Emerge About Fatally Shot Rioter"
"guanaco55"	"Religion, Liberty, and Religious Liberty -- Emmanuel Macron Pushes France to Confront Islamism"
"Shlomo_Maistre"	"LIVE: March for Trump in Atlanta, Georgia"
"ImbecileWillhelm"	"Ricky Schroder poses with accused Kenosha shooter after helping fund his $2 million bond"
"XIIXOO"	"Twitter says it will hand control of US president's official account to Joe Biden on January 20 - regardless of whether Donald Trump has left the White House"
"LawVol99"	"Trump’s gains in North Philly show Latino voters are not a ‘gimme’ for Democrats"
"Shlomo_Maistre"	"Giuliani Alleges Dominion Director's Ties to Antifa"
"HighRoller390"	"Once an election has been shown dirty, all voters have been disenfranchised- \"Joe Biden won illegal votes from thousands of noncitizens, study shows\""
"Clatsop"	"The “OFFICE”..."
"Shlomo_Maistre"	"Green Card Holder in Nevada Received Mail-In Ballot"
"HighRoller390"	"The ACLU and College Professors are Encouraging Book Burnings"
"Doc_Liberty"	"Merkel's Germany Tells Trump Not to Bring Troops Home from Afghanistan"
"jolielionne"	"Tucker Carlson And Media Elites Cozy Up To Private Equity Moguls"
"jolielionne"	"Democrats Do Drama – We Need to Stay Resolved, Disciplined, and Driven"
"tenshon"	"Sen. Tom Cotton: It's the 400th anniversary of the Pilgrims' arrival. Why haven't we heard more about it?"
"guanaco55"	"The Swing Senator -- How Susan Collins survived the resistance."
"guanaco55"	"Virginia Police Officers Deliver Thanksgiving Feasts Donated by Anonymous Family"
"guanaco55"	"Georgia Gov. Kemp Calls for Audit, Says Trump Can Demand New Recount"
"Tvair450"	"Military flights up 500% last week"
"geocentrist"	"Struggling Retailers Owe $52 Billion In Overdue Rents (Lockdown effect?)"
"Shlomo_Maistre"	"Jordan Sekulow to Newsmax TV: Pending Georgia Lawsuit 'Shocking'"
"invalid_data"	"Watch: Hundreds of Activists Gather for 'Stop the Steal' Rally in Georgia"
"guanaco55"	"Stacey Abrams’ Group Dropping $2.7 Million Ahead of Georgia Senate Runoffs"